import Container from "components/Container";
import { FC } from "react";
import CeoDesk from "assets/images/CEO/CEO_Pravoznavets_desk.jpg";
import CeoTab from "assets/images/CEO/CEO_Pravoznavets_tab.jpg";
import CeoMob from "assets/images/CEO/CEO_Pravoznavets_mob.jpg";
import {
  LawyerDescriptionThumb,
  LawyerThumb,
  LawyerText,
  PhotoThumb,
  LawyerSection,
  LawyerImage,
} from "./Lawyer.styled";
import { VisibilityHidden } from "components/SharedLayout/SharedLayout.styled";

const Lawyer: FC = () => {
  return (
    <LawyerSection>
      <Container>
        <LawyerThumb>
          <PhotoThumb>
            <picture>
              <source
                srcSet={CeoDesk}
                media="(min-width: 1280px)"
                width="100%"
              />
              <source srcSet={CeoTab} media="(min-width: 768px)" width="100%" />
              <LawyerImage
                srcSet={CeoMob}
                alt="Оксана Шульгa; Адвокат; Правознавець; Юрист"
                width="100%"
              />
            </picture>
          </PhotoThumb>
          <LawyerDescriptionThumb>
            <VisibilityHidden>
              <h2>Оксана Шульга</h2>
              <h2>Правознавець</h2>
              <h3>Адвокат</h3>
            </VisibilityHidden>
            <LawyerText>
              Вітаю! Мене звати Оксана Шульга і я з раннього віку борюсь за
              справедливість в цьому світі: в дитинстві завжди стояла на стороні
              скривдженого, навіть якщо сили були нерівні. Згодом, вирішила, що
              цей дух боротьби за правду має знайти своє місце в дорослому
              житті, та обрала шлях адвоката.
            </LawyerText>
            <LawyerText>
              У 2010 році я здобула ступінь магістра права та завершила навчання
              в Українській школі законотворчості при Інституті законодавства
              Верховної Ради України. Пізніше отримала Сертифікат корпоративного
              секретаря від Українського інституту корпоративного управління.
            </LawyerText>
            <LawyerText>
              Мій досвід як юриста та адвоката охоплює широкий спектр юридичних
              сфер, включаючи нерухомість, фармацевтичне та медичне право,
              корпоративне право, інтелектуальну власність, а також
              господарські, цивільні та адміністративні справи. Я поєдную
              аналітичне мислення, прагматизм та увагу до деталей, що допомагає
              мені успішно керувати юридичними процесами та проводити
              переговори. Моє професійне кредо – відповідальність,
              результативність і ведення справ так, щоб навіть мій опонент
              усвідомлював свою неправоту.
            </LawyerText>
            <LawyerText>
              З 2020 року я активно практикую як адвокат, спеціалізуючись на
              перевірках органами державного нагляду та контролю (податкова,
              Держпраці, ДСНС, Держспоживслужба тощо), управлінні корпоративними
              та ліцензійними угодами, а також на веденні судових справ на всіх
              етапах – від переговорів та медіації до виконання судових рішень.
              Маю значний досвід у оскарженні податкових повідомлень-рішень та
              вирішенні сімейних спорів. Я здійснюю аудит житлових та
              комерційних об’єктів нерухомості та супроводжую укладення угод з
              купівлі-продажу, дарування, міни квартир, будинків, офісів,
              земельних ділянок, а також рухомого майна. Мій досвід охоплює
              питання мобілізації, проходження військової служби та перетину
              державного кордону. Я супроводжувала процеси створення ОСББ та
              врегулювання суперечок між ОСББ та управлінською компанією.
            </LawyerText>
            <LawyerText>
              Крім того, я спеціалізуюсь на впровадженні GDPR та електронного
              документообігу в корпоративному бізнесі. Я неодноразово проводила
              Due diligence на підприємствах, отримувала необхідні для бізнесу
              ліцензії та дозволи та здійснювала реєстрацію торговельних марок
              та авторських прав.
            </LawyerText>
            <LawyerText>
              <b>
                Таким чином, відвідавши цей сайт, ви отримуєте унікальну
                можливість скористатися послугами висококваліфікованих юристів,
                серед яких я та мої надійні партнери. Ми готові запропонувати
                професійну правову допомогу, що ґрунтується на багаторічному
                досвіді та глибоких знаннях у різних галузях права.
              </b>
            </LawyerText>
          </LawyerDescriptionThumb>
        </LawyerThumb>
      </Container>
    </LawyerSection>
  );
};

export default Lawyer;
