import Container from "components/Container";
import {
  ArticleList,
  ArticleListItem,
  ArticleNumberedItem,
  ArticleText,
  ArticleTitle,
} from "../Articles.styled";

const FamiliarizingEmployeesWithDocuments = () => {
  return (
    <Container>
      <ArticleTitle>
        Порядок організації процедури ознайомлення працівників із наказами,
        повідомленнями, іншими кадровими документами через засоби електронного
        зв’язку.
      </ArticleTitle>
      <ArticleText>
        <i>ч. 3 ст. 29 Кодексу законів про працю України</i> (далі по тексту –
        «КЗпП України») передбачає, що ознайомлення працівників з наказами
        (розпорядженнями), повідомленнями, іншими документами власника або
        уповноваженого ним органу щодо їхніх прав та обов’язків допускається{" "}
        <b>
          з використанням визначених у трудовому договорі засобів електронного
          зв’язку.
        </b>{" "}
        У такому разі підтвердженням ознайомлення вважається факт обміну
        відповідними електронними документами між власником або уповноваженим
        ним органом та працівником.
      </ArticleText>
      <ArticleText>
        <i>
          Стаття 5 Закону України «Про електронні документи та електронний
          документообіг»
        </i>{" "}
        (далі по тексту - Закону № 851) дозволяє обмінюватися електронними
        документами. Електронний документ — це не просто файл, створений у Word.
      </ArticleText>
      <ArticleList>
        <ArticleText>Електронним документ стає за двох умов:</ArticleText>
        <ArticleListItem>
          інформація зафіксована у вигляді електронних даних,
        </ArticleListItem>
        <ArticleListItem>є обов’язкові реквізити документа.</ArticleListItem>
      </ArticleList>
      <ArticleList>
        <ArticleText>
          Обов’язкові реквізити електронного документа — такі самі, як і в
          паперового:
        </ArticleText>
        <ArticleListItem>найменування юридичної особи,</ArticleListItem>
        <ArticleListItem>
          назва виду документа (не зазначають на листах),{" "}
        </ArticleListItem>
        <ArticleListItem>дата документа, </ArticleListItem>
        <ArticleListItem>реєстраційний індекс документа,</ArticleListItem>
        <ArticleListItem>заголовок до тексту документа,</ArticleListItem>
        <ArticleListItem>текст документа, </ArticleListItem>
        <ArticleListItem>підпис.</ArticleListItem>
      </ArticleList>
      <ArticleText>
        <i>Відповідно до ст. 6 Закону № 851</i> створення електронного документа
        завершується накладанням електронного підпису.
      </ArticleText>
      <ArticleText>
        <i>
          Стаття 1 Закону України «Про електронні довірчі послуги» (далі по
          тексту - «Закон № 2155»)
        </i>{" "}
        передбачає, що для засвідчення електронних документів використовується
        КЕП. Він надійніший та досконаліший за звичайний електронний підпис.
        Технології КЕП базуються на досягненнях криптографії.
      </ArticleText>
      <ArticleText>
        <b>
          Отже, КЕП може бути використаний для ознайомлення працівників із
          кадровими документами, але при цьому у трудовому договорі із
          відповідним працівником має бути передбачено відповідний засіб
          електронного зв’язку, тобто попередньо потрібно домовитися із
          працівником, які засоби зв’язку будуть використані.
        </b>
      </ArticleText>
      <ArticleList>
        <ArticleText>
          <u>
            Для цього в Компанії має бути дотримано наступний порядок
            організації процедури підписання кадрових документів КЕП:
          </u>
        </ArticleText>
        <ArticleNumberedItem>
          1. Директору видати розпорядження, яким встановити, що з метою
          оптимізації процесу обміну кадровими документами та ознайомлення з
          ними, усім працівникам отримати КЕП у акредитованому центрі
          сертифікації ключів до ____ року, на відділ управління персоналом
          покласти обов’язок надавати працівникам методичну допомогу в отриманні
          КЕП.
        </ArticleNumberedItem>
        <ArticleNumberedItem>
          2. Отримати заяву від працівника такого змісту:
          <ArticleText>
            «Прошу надсилати електронні документи для ознайомлення з ними на
            електронну пошту ___________________________, для розв’язання
            оперативних питань застосовувати мій особистий телефон
            ___________________________________.
          </ArticleText>
          <ArticleText>
            Зобов’язуюся засвідчувати ознайомлення за допомогою кваліфікованого
            електронного підпису упродовж робочого дня, часові межі якого
            визначені правилами внутрішнього трудового розпорядку Товариства, а
            якщо документ надійшов у позаробочий час — упродовж години з початку
            наступного робочого дня».
          </ArticleText>
        </ArticleNumberedItem>
        <ArticleNumberedItem>
          3. Видати наказ про те, що компанія ознайомлює відповідних працівників
          засобами електронного зв’язку із зазначенням електронної пошти такого
          працівника, а також обов’язково вказати, що працівник зобов’язується
          засвідчувати ознайомлення за допомогою кваліфікованого електронного
          підпису упродовж робочого дня, часові межі якого визначені правилами
          внутрішнього трудового розпорядку Товариства, а якщо документ надійшов
          у позаробочий час — упродовж години з початку наступного робочого дня.
        </ArticleNumberedItem>
      </ArticleList>
    </Container>
  );
};

export default FamiliarizingEmployeesWithDocuments;
