import Container from "components/Container";
import { FC } from "react";
import {
  ArticleContainer,
  ArticleParagraphTitle,
  ArticleText,
  ArticleTitle,
} from "../Articles.styled";

const CopyrightRegistration: FC = () => {
  return (
    <Container>
      <ArticleContainer>
        <ArticleTitle>
          Реєстрація авторського права та державна реєстрація товарного знака
        </ArticleTitle>
        <ArticleParagraphTitle>
          Реєстрація авторського права
        </ArticleParagraphTitle>
        <ArticleText>
          Сьогодні реєстрація авторських прав українців є тривалим процесом для
          отримання охоронного документа, тобто свідоцтва про реєстрацію права
          на власний твір, за допомогою державної реєстрації в головному
          Держдепартаменті України. Твір може бути у вигляді музики, віршів,
          пісень, комп'ютерної програми, фонограми, перекладу і так далі.
          Наприклад, сьогодні в Україні більш затребувана реєстрація авторських
          прав на книги, комп'ютерні програми, контент сайту, музику, дизайн
          сайту, пісні. Крім реєстрації авторських прав, широко затребувана
          реєстрація для передачі авторських прав на ті ж самі об'єкти
          авторського права. Варто знати, що за законодавством України,
          реєстрація авторського права є необов'язковим правом, оскільки для
          твору охорона з'являється з моменту його створення.
        </ArticleText>
        <ArticleText>
          Щодо популярності та переваг, які дає реєстрація авторського права, то
          тут все очевидно. Наприклад, у спірних моментах автор повністю
          звільняється від необхідності доводити свої права на авторство,
          оскільки після отримання свідоцтва у нього виникає автоматично
          презумпція. Тобто отримана презумпція стає звільненням від доказу
          авторства на певний твір не тільки в Україні, а й в інших країнах
          світу. Крім цього, свідоцтво підтверджує і закріплює конкретного
          автора, тому треті особи не можуть володіти його майновими правами. А
          ще реєстрація авторського права дозволяє укладати автору ліцензійні
          договори для передачі авторського права і дозволяє вносити автору його
          створений твір у капітал підприємства. Аналогічною дією володіє
          реєстрація для товарного знака або марки.
        </ArticleText>
        <ArticleParagraphTitle>
          Державна реєстрація товарного знака
        </ArticleParagraphTitle>
        <ArticleText>
          Ця реєстрація підтверджує власність господаря підприємства на його
          торгову марку. Готовий торговий знак є самостійним товаром після
          завершення державної реєстрації. У результаті у господаря торгової
          марки з'являється безліч переваг, де головні з них – це ефективна та
          недорога реклама своєї торгової марки, що більш вигідно, ніж реклама
          повного асортименту послуг або товарів.
        </ArticleText>
        <ArticleText>
          Уже зареєстрована торгова марка має цілий ряд функцій. Наприклад, вона
          фіксує свої відмінні риси всіх вироблених послуг або товарів, а також
          дає ім'я цим послугам або товарам, в результаті це допомагає
          споживачам запам'ятовувати і відразу впізнавати продукцію підприємства
          за його торговим знаком. Окрім цього, державна реєстрація товарного
          знака допомагає доносити інформацію про послуги або товари компанії,
          гарантує якість товару, а також стимулює бажання покупців придбати
          саме цей товар.
        </ArticleText>
        <ArticleText>
          Що стосується самого власника товарного знака, то він отримує масу
          переваг і прав. Наприклад, він має право використання свого товарного
          знака, ще він отримує право на дозвіл використання його знака, право
          на заборону його використання, а також має право для перешкоджання
          неправомірному використанню його знака. Крім цього, власник товарного
          знака має права для часткового або повного продажу своєї торгової
          марки, а також може передати права на товарний знак третій особі.
        </ArticleText>
        <ArticleText>
          Перед тим як подавати всі документи на реєстрацію торгової марки,
          необхідно переконатися в тому, що такий знак або логотип ще не
          зареєстрований або вже не поданий на реєстрацію іншими особами.
          Перевірка на схожість і на достовірність торгового знака може
          проводитися не тільки в Україні, але й у межах країн Європейського
          Союзу, а також може здійснюватися за допомогою пошуку за Мадридською
          угодою. Така перевірка може включати зображувальні та словесні знаки
          або їх комбінації.
        </ArticleText>
      </ArticleContainer>
    </Container>
  );
};

export default CopyrightRegistration;
