import Container from "components/Container";
import React, { FC } from "react";
import {
  ArticleContainer,
  ArticleText,
  ArticleTitle,
  LiteratureHeader,
  LiteratureItem,
  LiteratureList,
} from "../Articles.styled";

const Covenant: FC = () => {
  return (
    <Container>
      <ArticleContainer>
        <ArticleTitle>До питання правової природи заповіту</ArticleTitle>
        <ArticleText>
          Значення заповіту полягає у тому, що він встановлює порядок переходу
          майна спадкодавця, згідно його волі, до його спадкоємців, а сам
          перехід здійснюється в силу висловленої ними згоди прийняти це майно.
          Тому, об`єктом заповідального розпорядження є майно, яке переходить до
          спадкоємців у тому складі, який воно мало в момент смерті заповідача
          (4, с. 40). В зв`язку з переходом майна від спадкодавця до спадкоємців
          виникають два, тісно пов`язаних між собою питання: про поняття
          спадщини і характер спадкового правонаступництва.
        </ArticleText>
        <ArticleText>
          В юридичній енциклопедії термін майно визначено як певна річ або
          сукупність речей, у т.ч. гроші і цінні папери; сукупність майнових
          прав (прав вимоги) певної особи (актив); сукупність прав та обов`язків
          певної особи, які характеризують її майнове становище, до складу майна
          в останньому випадку входять речі і права, що належать певній особі і
          визначають актив майна, а також її борги, що становлять пасив майна
          (6, с. 551) .
        </ArticleText>
        <ArticleText>
          Васильченко В.В. зазначає, що спадкова маса, як у римському, так і
          сучасному праві України, являє собою не сукупність речей, а певний
          комплекс правочинностей. Вона містить в своєму складі не тільки право
          власності, але й інші правочини (наприклад, зобов`язання). Разом з тим
          спадкова маса – це сукупність обов`язків (боргів), що належать
          спадкодавцеві. З урахуванням явно вираженої диференціації складових
          частин спадкової маси її правильніше розглядати не як єдиний об`єкт
          спадкування, а як сукупність об`єктів, що переходять до спадкоємця. Це
          дозволяє, як пише В.В.Васильченко, визначити спадкову масу як
          “сукупність майнових прав та обов`язків, а в певному обсязі і
          сукупність особистих повноважень, що переходять до інших осіб в
          порядку спадкового правонаступництва на випадок смерті їх власника”
          (2, с. 18) .
        </ArticleText>
        <ArticleText>
          Цивільний кодекс України у статті 190 визначає, що майном як особливим
          об`єктом вважаються окрема річ, сукупність речей, а також майнові
          права та обов`язки. У зв`язку з тим, що поняття “майно” є збірним,
          необхідно правильно визначити його зміст стосовно правовідносин у
          спадковому праві.
        </ArticleText>
        <ArticleText>
          До поняття “майно” за спадковим правом входять речі, а також майнові
          права й обов`язки спадкодавця, за винятком тих, котрі нерозривно
          пов`язані з його особистістю (право на відшкодування шкоди, заподіяної
          життю і здоров`ю спадкодавця, на одержання аліментів, обов`язки за
          авторським договором замовлення на створення твору науки, літератури і
          мистецтва, а також інші подібні права й обов`язки (5, с. 164) .
        </ArticleText>
        <ArticleText>
          Проте в юридичній літературі існують різні підходи до розуміння
          досліджуваного явища. Так, наприклад, у різних статтях ЦК України, ми
          зустрічаємо наступні терміни: майно, спадкова маса, спадкове майно. У
          спадковому праві ці поняття використовуються як синоніми одного і того
          ж поняття, хоча точнішим є термін “спадщина”, як такий, що охоплює
          сукупність цивільних прав і обов`язків спадкодавця.
        </ArticleText>
        <ArticleText>
          Відповідно до ст. 1218 Цивільного кодексу України до складу спадщини
          входять усі права та обов`язки, що належали спадкодавцеві на момент
          відкриття спадщини і не припинилися внаслідок його смерті.
        </ArticleText>
        <ArticleText>
          Коли йдеться про спадщину, припускається, що активи спадщини
          перевищують можливі пасиви (борги). Проте, оскільки при спадкуванні
          має місце універсальне правонаступництво, до складу спадщини або
          об`єкту заповіту входять всі права та обов`язки (тобто, не тільки
          активи, але й пасиви), що належали спадкодавцеві на момент відкриття
          спадщини. Але слід мати на увазі, що деякі цивільні права та обов`язки
          нерозривно пов`язані з певною особою, тому вони не можуть переходити у
          спадок. Отже, об`єктами заповіту є цивільні права й обов`язки
          спадкодавця, що можуть переходити у спадщину, тобто ті, існування яких
          не припиняється смертю певної фізичної особи і, передусім, право
          власності на речі, доходи і грошові заощадження.
        </ArticleText>
        <ArticleText>
          У західних країнах об`єктом заповіту в першу чергу є певне майно, що
          належить спадкодавцеві, але до заповіту можуть бути включені і
          положення іншого роду, наприклад призначення піклувальника
          неповнолітньому (3, с. 538).
        </ArticleText>
        <ArticleText>
          До об`єктів заповіту можуть входити також права й обов`язки
          спадкодавця, що випливають із зобов`язальних, авторських,
          винахідницьких та інших цивільних правовідносин. Так, якщо
          спадкодавець мав боржників, то право вимагати від них повернення боргу
          переходить до суб`єктів заповіту – спадкоємців. До об`єкту заповітів
          входить також право на одержання авторського гонорару, винагороди за
          винахід тощо.
        </ArticleText>
        <ArticleText>
          Особливим є режим спадкування за законодавством майнових, авторських
          прав. Так, при спадкуванні за заповітом права можуть бути передані
          будь-якому громадянину, незалежно від його громадянства і наявності
          родинних зв`язків із заповідачем, а також юридичній особі, незалежно
          від профілю її діяльності. До спадкоємців за заповітом переходять лише
          майнові авторські права передбачені ч.2 ст. 440, ч. 4 ст. 442, ч.2 ст.
          448 ЦК України. Перехід у спадок особистих немайнових прав авторів
          законодавством не передбачений.
        </ArticleText>
        <ArticleText>
          Поряд з вищенаведеним, законодавством встановлено режим обмежень щодо
          об’єктів спадкування за заповітом. Не можуть бути об`єктом заповіту
          права та обов`язки, що нерозривно пов`язані з особою спадкодавця, які
          не входять до складу спадщини, зокрема: особисті немайнові права
          фізичної особи (що ж стосується права на захист репутації автора, то
          його заповідати не можна, але на спадкоємців законом покладений
          обов`язок стосовно охорони недоторканості твору, протидії його
          перекрученню, спотворенню та іншій зміні, що може завдати шкоди честі
          та репутації автора, (5, с. 395)); право на участь у товариствах та
          право членства в об`єднаннях громадян, якщо інше не встановлено
          законом або їх установчими документами; право на відшкодування шкоди у
          зв`язку з каліцтвом або іншими ушкодженнями здоров`я; права на
          аліменти, не пенсію, допомогу або інші виплати, встановлені законом,
          які покликані забезпечити наявність засобів існування для конкретних
          осіб; права і обов`язки як кредитора або боржника, передбачені ст. 608
          ЦК України.
        </ArticleText>
        <ArticleText>
          Виходячи зі змісту статті 1236 ЦК України, об`єктом заповіту є майно
          спадкодавця, його майнові права і обов`язки, навіть і ті, яких не було
          в наявності на момент складання заповіту, але які можуть належати
          спадкодавцеві в майбутньому, на час відкриття спадщини.
        </ArticleText>
        <ArticleText>
          Також об`єктами заповіту можуть бути і обов`язки, які встановлені
          окремими статтями ЦК України: відшкодування майнової шкоди (збитків),
          яка була завдана спадкодавцем; відшкодування моральної шкоди, завданої
          спадкодавцем, яке було присуджено судом зі спадкодавця за його життя;
          сплата неустойки (штрафу, пені), яка була присуджено судом кредиторові
          із спадкодавця за життя спадкодавця; відшкодування витрат на
          утримання, догляд, лікування та поховання спадкодавця; відшкодування
          витрат на охорону спадкового майна; плата виконавцю заповіту за
          виконання своїх повноважень. Відповідальність за борги спадкодавця
          розподіляється між спадкоємцями пропорційно до отриманої кожним з них
          частки спадщини, у межах її вартості (4, с. 42).
        </ArticleText>
        <ArticleText>
          Отже, на підставі проведеного дослідження ми можемо констатувати той
          факт, що перелік об’єктів, які можуть бути об’єктом заповіту є
          законодавчо вичерпно не встановлений і тому з часом можуть бути
          встановлені інші об`єкти заповідальних відносин.
        </ArticleText>
        <LiteratureList>
          <LiteratureHeader>
            <em>Список літератури</em>
          </LiteratureHeader>
          <LiteratureItem>
            1. Цивільний кодекс України вiд 16.01.2003 № 435-IV // Відомості
            Верховної Ради (ВВР), 2003, NN 40-44, ст.356
          </LiteratureItem>
          <LiteratureItem>
            2. Васильченко В. В. Рецепція римського спадкового права в сучасному
            спадковому праві України./ Автореф. дисерт. на здобуття наук.
            ступеня канд. юр. наук. – К., 1997. – 175 с.
          </LiteratureItem>
          <LiteratureItem>
            3. Гражданское и торговое право капиталистических государств:
            Учебник / Отв. ред. Е. А. Васильев. – 3-е изд., перераб. и доп. –
            М.: Международные отношения, 1993. – 560 с.
          </LiteratureItem>
          <LiteratureItem>
            4. Дроников, В. К. Наследование по завещанию в советском праве /
            Отв. ред. Я. Л. Штутин; Министерство высшего образования УССР.
            Киевский государственный университет им. Т. Г. Шевченко. – Киев :
            Изд-во Киевского гос. ун-та им. Т. Г. Шевченко, 1957. – 136 с.
          </LiteratureItem>
          <LiteratureItem>
            5. Цивільний кодекс України: Коментар / За заг.ред. Є. О.
            Харитонова, О. М. Калітенко.– Одеса: Юридична література, 2004. –
            1112 с.
          </LiteratureItem>
          <LiteratureItem>
            6. Юридична енциклопедія: В 6 т. /Редкол.: Ю. С. Шемшученко (голова
            редкол.) та ін. ,Т.3 – К.: «Укр. Енцикл.», 2001. – 792 с.
          </LiteratureItem>
        </LiteratureList>
      </ArticleContainer>
    </Container>
  );
};

export default Covenant;
