import Container from "components/Container";
import PlaceHolder from "assets/images/bussines_1280_853-2x.jpg";
import Article from "components/Article";
import { ArticleItem } from "./ArticlesPage.styled";

const ArticlesPage = () => {
  return (
    <Container>
      <ul>
        <ArticleItem>
          <Article
            title="Реєстрація авторських прав та патент на назву фірми"
            description="Для виділення товару використовують певні позначення або їх
                комбінацію. Така позначення або їх комбінація називається
                торговельною маркою. Торговельна марка застосовується при
                виділенні товару чи послуг, які або виготовляються, або
                надаються одним суб'єктом господарської діяльності для іншого.
                Для отримання торговельної марки зазвичай використовують цифри,
                літери, слова, різні логотипи та малюнки."
            image={PlaceHolder}
            link="company-name-patent"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Як правильно перевірити та зареєструвати торгову марку?"
            description={`Напис, малюнок, візерунок чи їх комбінація в
            міжнародному праві називаються торговою маркою, в українському законодавстві
            їх називають "знаком товару чи послуги". Торгова марка закріплюється за
            певним товаром після її офіційної реєстрації. Тільки власник законно
            зареєстрованого знаку може звертатися у разі необхідності за захистом свого
            права на використання конкретного зображення.`}
            image={PlaceHolder}
            link="trademark"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Правове регулювання атестаціх працівників"
            description="Стаття підготовлена на основі аналізу трудового законодавства 
            України та доктринальних теорій. У ній висвітлюються поняття атестації 
            працівників, принципи правового регулювання, критерії відмежування атестації 
            працівників від схожих правових явищ, а також наводиться перелік 
            нормативно-правових актів, які врегульовують відносини з питань атестації 
            працівників."
            image={PlaceHolder}
            link="employee-certification"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Як повернути гроші в магазині за куплений товар"
            description="Від дорогої сумки на наступний день після покупки відвалився логотип. А 
            на фірмових джинсах відсутня пара заклепок. Але, в цілому, з твоїми покупками все в порядку, 
            і серйозної причини для звернення до організації захисту прав споживачів, здається, немає. Ти 
            йдеш в магазин із твердим наміром повернути свої придбання і отримати гроші. Продавець 
            пропонує тобі замінити покупки на такі ж, але без дефектів."
            image={PlaceHolder}
            link="return-money"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Принципи правового регулювання атестації як принципи правового регулювання праці"
            description=" У статті проаналізовано та роз’яснено зміст основних принципів правового регулювання 
            атестації працівників, викладено особливості їх співвідношення з принципами правового регулювання праці. "
            image={PlaceHolder}
            link="polrocapolrol"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Досудове розслідування"
            description="Стаття підготовлена на основі кримінально-процесуального законодавства України.
            У ній висвітлюються загальні положення досудового слідства та дізнання. Для студентів, аспірантів і викладачів вищих навчальних закладів."
            image={PlaceHolder}
            link="pre-trial-investigation"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="До питання правової природи заповіту"
            description="Стаття підготовлена на основі цивільного законодавства, зокрема Цивільного кодексу України та доктрини. 
            У ній висвітлено загальні положення про майно. Значна увага приділяється поняттю спадщини як об`єкту заповіту та особливостям спадкового правонаступництва."
            image={PlaceHolder}
            link="covenant"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Співвідношення договору поставки та договору купівлі-продажу"
            description="Стаття підготовлена на основі цивільного та господарського законодавства України. 
            У ній висвітлюються загальні положення договору поставки та договору купівлі-продажу. 
            Значна увага приділяється визначенню критеріїв розмежування цих договорів."
            image={PlaceHolder}
            link="purchase-sale-agreement"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Реєстрація авторського права та державна реєстрація товарного знака"
            description="Сьогодні реєстрація авторських прав українців є тривалим процесом 
            для отримання охоронного документа, тобто свідоцтва про реєстрацію права на власний твір, 
            за допомогою державної реєстрації в головному Держдепартаменті України."
            image={PlaceHolder}
            link="copyright-registration"
          />
        </ArticleItem>
        <ArticleItem>
          <Article
            title="Ліцензія на алкоголь"
            description="Ліцензування алкогольної діяльності лежить у компетенції Державної фіскальної 
            служби України. Для отримання ліцензії на алкоголь суб'єкт господарювання повинен надати 
            комплект документів."
            image={PlaceHolder}
            link="license-for-alcohol"
          />
        </ArticleItem>
      </ul>
    </Container>
  );
};

export default ArticlesPage;
