import Container from "components/Container";
import {
  ArticleList,
  ArticleListItem,
  ArticleText,
  ArticleTitle,
} from "../Articles.styled";

const EnterpriseCivilProtection = () => {
  return (
    <Container>
      <ArticleTitle>
        Обов’язки особи відповідальної за цивільний захист на підприємстві
      </ArticleTitle>
      <ArticleList>
        <ArticleText>
          Відповідно до п. 5 Типового положення про підрозділ з питань
          цивільного захисту суб’єкта господарювання, затвердженого Наказом
          Міністерства внутрішніх справ України від 20.04.2017 № 325 (надалі –
          «Типове положення») основними завданнями підрозділу з питань
          цивільного захисту є:
        </ArticleText>
        <ArticleListItem>
          організація виконання заходів у сфері цивільного захисту на об’єктах
          суб’єкта господарювання, спрямованих на захист працівників, майна і
          територій від надзвичайних ситуацій, зменшення ризику їх виникнення та
          забезпечення сталого функціонування суб’єкта господарювання в умовах
          надзвичайної ситуації і в особливий період;
        </ArticleListItem>
        <ArticleListItem>
          забезпечення виконання завдань, створених суб’єктом господарювання,
          органами управління і силами цивільного захисту та підтримання їх
          готовності до дій за призначенням;
        </ArticleListItem>
        <ArticleListItem>
          забезпечення виконання вимог законодавства у сфері цивільного захисту,
          техногенної та пожежної безпеки.
        </ArticleListItem>
        <ArticleListItem>
          Згідно з приписами п. 6 Типового положення підрозділ з питань
          цивільного захисту відповідно до покладених завдань:
        </ArticleListItem>
        <ArticleListItem>
          забезпечує виконання заходів у сфері цивільного захисту на об’єкті
          суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          надає пропозиції, організовує та контролює виконання заходів щодо
          забезпечення дотримання вимог законодавства щодо створення,
          зберігання, утримання, використання та реконструкції захисних споруд
          цивільного захисту;
        </ArticleListItem>
        <ArticleListItem>
          здійснює облік та веде документацію з утримання захисних споруд
          цивільного захисту, які перебувають на балансі (утриманні),
          організовує утримання їх та забезпечує готовність цих споруд до
          укриття людей у разі виникнення надзвичайних ситуацій;
        </ArticleListItem>
        <ArticleListItem>
          організовує забезпечення працівників суб’єкта господарювання засобами
          індивідуального захисту органів дихання та засобами колективного
          захисту;
        </ArticleListItem>
        <ArticleListItem>
          організовує (на хімічно небезпечному об’єкті) взаємодію з місцевими
          органами виконавчої влади та органами місцевого самоврядування щодо
          участі в забезпеченні засобами індивідуального захисту органів дихання
          непрацюючого населення, яке проживає в прогнозованій зоні хімічного
          забруднення цього суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          забезпечує розміщення інформації (наочної агітації) про заходи безпеки
          та відповідну поведінку працівників і населення, яке проживає в зонах
          можливого ураження, у разі виникнення аварії на об’єктах суб’єкта
          господарювання;
        </ArticleListItem>
        <ArticleListItem>
          організовує створення і забезпечення функціонування спеціальних,
          локальних і об’єктових систем оповіщення;
        </ArticleListItem>
        <ArticleListItem>
          організовує виконання заходів щодо впровадження інженерно-технічних
          заходів цивільного захисту, що зменшують ступінь ризику виникнення
          аварій, пожеж та вибухів на об’єктах суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          здійснює планування та забезпечує контроль за підготовкою та
          проведенням під час виникнення надзвичайних ситуацій заходів з
          евакуації працівників та майна суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          організовує та забезпечує проведення з працівниками індивідуального і
          курсового навчання за програмами підготовки до дій у надзвичайних
          ситуаціях, а також інструктажів з питань цивільного захисту,
          техногенної та пожежної безпеки;
        </ArticleListItem>
        <ArticleListItem>
          є робочим органом комісії з питань надзвичайних ситуацій суб’єкта
          господарювання, забезпечує підготовку та контроль за виконанням її
          рішень;
        </ArticleListItem>
        <ArticleListItem>
          розробляє проекти наказів керівника суб’єкта господарювання щодо
          організації та реалізації заходів цивільного захисту;
        </ArticleListItem>
        <ArticleListItem>
          розробляє план реагування на надзвичайні ситуації суб’єкта
          господарювання;
        </ArticleListItem>
        <ArticleListItem>
          розробляє план цивільного захисту суб’єкта господарювання на особливий
          період, який продовжує роботу у воєнний час та який віднесено до
          категорії з цивільного захисту;
        </ArticleListItem>
        <ArticleListItem>
          організовує розроблення планів локалізації та ліквідації наслідків
          аварій на об’єктах підвищеної небезпеки, які належать до сфери
          управління суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          організовує розроблення проекту плану основних заходів цивільного
          захисту суб’єкта господарювання на рік;
        </ArticleListItem>
        <ArticleListItem>
          розробляє план-графік проведення спеціальних об’єктових навчань і
          тренувань з питань цивільного захисту, організовує його виконання та
          звітує за результатами проведених навчань, тренувань;
        </ArticleListItem>
        <ArticleListItem>
          організовує та контролює проходження посадовими особами суб’єкта
          господарювання навчання з питань цивільного захисту, пожежної безпеки;
        </ArticleListItem>
        <ArticleListItem>
          готує звітні документи з питань цивільного захисту;
        </ArticleListItem>
        <ArticleListItem>
          здійснює супровід посадових осіб органів державного нагляду з метою
          перевірки готовності сил цивільного захисту для проведення робіт за
          призначенням;
        </ArticleListItem>
        <ArticleListItem>
          організовує та забезпечує виконання вимог законодавства у сфері
          техногенної та пожежної безпеки, а також надає пропозиції щодо
          виконання вимог приписів, постанов та розпоряджень ДСНС України та її
          територіальних органів;
        </ArticleListItem>
        <ArticleListItem>
          організовує проведення ідентифікації об’єктів підвищеної небезпеки
          суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          організовує заходи з декларування безпеки об’єктів підвищеної
          небезпеки суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          надає пропозиції та контролює виконання заходів щодо впровадження
          автоматичних засобів виявлення та гасіння пожеж і використання для
          цієї мети виробничої автоматики;
        </ArticleListItem>
        <ArticleListItem>
          організовує та контролює утримання у справному стані засобів
          цивільного та протипожежного захисту, недопущення їх використання не
          за призначенням;
        </ArticleListItem>
        <ArticleListItem>
          забезпечує своєчасне інформування відповідних органів та підрозділів
          цивільного захисту про стан та виконання заходів цивільного захисту
          суб’єктом господарювання;
        </ArticleListItem>
        <ArticleListItem>
          надає пропозиції керівнику суб’єкта господарювання щодо:
        </ArticleListItem>
        <ArticleListItem>
          створення аварійно-рятувальних служб (на суб’єктах господарювання, які
          експлуатують об’єкти підвищеної небезпеки), об’єктових формувань
          цивільного захисту, спеціалізованих служб цивільного захисту,
          необхідних для їх функціонування та забезпечення готовності до дій за
          призначенням матеріально-технічної бази;
        </ArticleListItem>
        <ArticleListItem>
          планування матеріальних та фінансових витрат для виконання заходів
          цивільного захисту, що зменшують рівень ризику виникнення надзвичайних
          ситуацій на об’єктах суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          забезпечення відповідно до вимог Кодексу цивільного захисту України
          обов’язкового аварійно-рятувального обслуговування об’єктів підвищеної
          небезпеки суб’єкта господарювання, на яких існує небезпека виникнення
          надзвичайних ситуацій;
        </ArticleListItem>
        <ArticleListItem>
          створення, накопичення, порядку зберігання і використання об’єктових
          матеріальних резервів для запобігання та ліквідації наслідків
          надзвичайних ситуацій;
        </ArticleListItem>
        <ArticleListItem>
          розроблення заходів забезпечення цивільного захисту, впровадження
          досягнень науки і техніки, позитивного досвіду із зазначеного питання;
        </ArticleListItem>
        <ArticleListItem>
          розроблення інструкцій та проектів наказів з питань цивільного
          захисту, здійснення постійного контролю за їх виконанням;
        </ArticleListItem>
        <ArticleListItem>
          забезпечує виконання інших завдань і заходів у сфері цивільного
          захисту, передбачених Кодексом цивільного захисту України та іншими
          нормативно-правовими актами.
        </ArticleListItem>
      </ArticleList>

      <ArticleList>
        <ArticleText>
          Також, пункт 10 Типового положення визначає, що керівник підрозділу з
          питань цивільного захисту:
        </ArticleText>
        <ArticleListItem>
          здійснює керівництво діяльністю підрозділу, відповідає за виконання
          покладених на підрозділ завдань та прийняті ним рішення;
        </ArticleListItem>
        <ArticleListItem>
          організовує діяльність підрозділу, спрямовану на розроблення і
          здійснення заходів щодо захисту, запобігання і реагування на
          надзвичайні ситуації;
        </ArticleListItem>
        <ArticleListItem>
          розробляє проекти наказів керівника суб’єкта господарювання з питань
          організації та виконання заходів цивільного захисту;
        </ArticleListItem>
        <ArticleListItem>
          формує проекти планів у сфері цивільного захисту на мирний час та
          особливий період суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          контролює в межах компетенції виконання наказів з питань цивільного
          захисту працівниками суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          забезпечує в підрозділі виконання вимог законодавства, зокрема,
          Кодексу цивільного захисту України, Кодексу законів про працю України;
        </ArticleListItem>
        <ArticleListItem>
          визначає та затверджує функціональні обов’язки працівників підрозділу;
        </ArticleListItem>
        <ArticleListItem>
          подає пропозиції щодо призначення на посаду та звільнення з посади
          працівників підрозділу;
        </ArticleListItem>
        <ArticleListItem>
          готує пропозиції в межах компетенції до проектів наказів керівника
          суб’єкта господарювання;
        </ArticleListItem>
        <ArticleListItem>
          уносить у встановленому порядку пропозиції щодо обмеження, а в разі
          потреби - припинення роботи суб’єкта господарювання, окремих цехів,
          експлуатації робочих місць до усунення порушень, які можуть призвести
          до виникнення надзвичайних ситуацій або загрожують життю та здоров’ю
          працівників;
        </ArticleListItem>
        <ArticleListItem>
          ініціює проведення в установленому порядку нарад з питань, що належать
          до компетенції підрозділу.
        </ArticleListItem>
      </ArticleList>
    </Container>
  );
};

export default EnterpriseCivilProtection;
